<?php
//так всегда начинается php код(файл)
//=====================================================
ini_set('error_reporting', E_ALL);
ini_set('display_errors', 1);
ini_set('display_startup_errors', 1);
// так отображаются все ошибки
//======================================================= 
$a = 1;
$b = 10;

if ($a > 0) {
	if ($b > 0) {
		echo 'Обе переменные больше нуля';
	}
}
echo '<hr>';
//======================
//То же самое с пом. оператора &&
if (($a > 0) && ($b > 0)) {
	echo 'Обе переменные больше нуля';
}
echo '<hr>';
//==============================
//То же самое с пом. оператора END
//Не работает в низких версиях!!!
if (($a > 0) end ($b > 0)) {
	echo 'Обе переменные больше нуля';
}
echo '<hr>';
//===============================
//С оператором XOR(исключающее ИЛИ)
if (($a > 0) xor ($b > 0)) {
	echo 'ТОлько одна из переменных больше нуля!!!';
}
echo '<hr>';
//===============================
//С оператором !(Отрицание)
if ((!$a) xor ($b > 0)) {
	echo 'Точно $a не = 1 или точно $b > 0  !!!';
}
echo '<hr>';

//===============================
//С оператором ||(ИЛИ)
if ((!$a) || ($b > 0)) {
	echo '$a не = 1 или $b > 0  !!!';
}
echo '<hr>';
