<?php

header('Content-Type: text/html; charset=utf-8');
// теперь можно писать на русском без кракозяблов
//======================================================
ini_set('error_reporting', E_ALL);
ini_set('display_errors', 1);
ini_set('display_startup_errors', 1);
// так отображаются все ошибки
//=======================================================

include_once 'horisontell_meny.php';

include_once 'footer.php';

?>


<title>Вызов ветеринара на дом.Ветеринарная клиника Лакки</title>

<style>
   p {
    text-indent: 20px; /* Отступ первой строки в пикселах */
   }
  </style>
<p>

<b>Предоставляем услуги по лечению и профилактике заболеваний следующих видов животных:</b><br>
 &nbsp - кошки<br>
 &nbsp - собаки <br>
 &nbsp - хорьки <br>
 &nbsp - еноты <br>
 &nbsp - кролики <br>
 &nbsp - крысы <br>
 &nbsp - хомяки <br>
 &nbsp - шиншилы <br>
 &nbsp - черепахи <br>
 &nbsp - декоративная птица </p>
<p>
 
 
  <h3>ДЕРМАТОЛОГИЯ</h3>
 &nbsp &nbsp  -- проведение дерматологического осмотра <br>
 &nbsp &nbsp  -- забор соскобов с кожи <br>
 &nbsp &nbsp  -- цитология мазков-отпечатков с кожи <br>
  &nbsp &nbsp -- цитология мазков-отпечатков с уха <br>
 &nbsp &nbsp  -- диагностика отодектоза <br>
  &nbsp &nbsp -- диагностика дерматофитии <br>
  &nbsp &nbsp -- лечение аллергии <br>
  &nbsp &nbsp -- лечение заболеваний, вызваных чесоточными клещами <br>
  &nbsp &nbsp -- лечение отитов любой этиологии и сложности <br>
 <br>
 <h3>ХИРУРГИЯ</h3>
  &nbsp &nbsp   -- стерилизация кошек <br>
  &nbsp &nbsp   -- стерилизация сук <br>
  &nbsp &nbsp   -- стерилизация хорьчих <br>
   &nbsp &nbsp  -- стерилизация крольчих <br>
   &nbsp &nbsp  -- стерилизация самок крыс <br>
   &nbsp &nbsp  -- кастрация котов <br>
   &nbsp &nbsp  -- кастрация кобелей <br>
   &nbsp &nbsp  -- кастрация хорьков <br>
  &nbsp &nbsp   -- кастрация кроликов <br>
  &nbsp &nbsp   -- кастрация самцов крыс <br>
   &nbsp &nbsp  -- экстерпация параанальных желез у хорьков <br>
  &nbsp &nbsp   -- операции на желудке и кишечнике <br>
  &nbsp &nbsp   -- оперативное удаление камней с мочевого пузыря (цистолитотомия) <br>
   &nbsp &nbsp  -- пиометра у сук, кошек, крольчих, крыс <br>
   &nbsp &nbsp  -- оперативное удаление новообразований кожи <br>
   &nbsp &nbsp  -- оперативное лечение новообразований в брюшной полости <br>
   &nbsp &nbsp  -- оперативное удаление новообразований в области головы <br>
   &nbsp &nbsp  -- лечение пупочных грыж <br>
   &nbsp &nbsp  -- операции при выпадении прямой кишки <br>
   &nbsp &nbsp  -- хирургическое лечение ран любой сложности <br><br>

  <h3>ОФТАЛЬМОЛОГИЯ</h3>
   &nbsp &nbsp  -- диагностика проходимости носо-слезного канала <br>
   &nbsp &nbsp  -- лечение конъюнктивитов <br>
   &nbsp &nbsp  -- лечение кератитов <br>
   &nbsp &nbsp  -- лечение язв роговицы <br>
   &nbsp &nbsp  -- лечение инфекционных заболеваний глаз <br>
   &nbsp &nbsp  -- коррекция заворота и выворота век <br>
   &nbsp &nbsp  -- удаление глазного яблока <br><br>

  <h3>ЛЕЧЕНИЕ ИНФЕКЦИОННЫХ ЗАБОЛЕВАНИЙ</h3>
  &nbsp &nbsp   -- панлейкопения кошек <br>
   &nbsp &nbsp  -- ВИК (вирус иммунодефицита кошек) <br>
  &nbsp &nbsp   -- ВЛК (вырус лейкоза кошек) <br>
  &nbsp &nbsp   -- коронавироз кошек и собак <br>
   &nbsp &nbsp  -- герпесвирус кошек <br>
   &nbsp &nbsp  -- хламидиоз кошек <br>
   &nbsp &nbsp  -- токсоплазмоз кошек и собак <br>
   &nbsp &nbsp  -- калицивироз кошек <br>
   &nbsp &nbsp  -- парвовирусный энтерит собак (парвовироз) <br>
   &nbsp &nbsp  -- чума собак (чума плотоядных) <br>
   &nbsp &nbsp  -- бордерелез <br>
   &nbsp &nbsp  -- лептоспироз <br>
   &nbsp &nbsp  -- боррелиоз (болезнь Лайма) <br>
   &nbsp &nbsp  -- бабезиоз (пироплазмоз) собак <br>
   &nbsp &nbsp  -- эрлихиоз <br>
   &nbsp &nbsp  -- анаплазмоз <br><br>

<h3>ТЕРАПИЯ</h3>
  &nbsp <b>-- Заболевания почек:</b> <br>
    &nbsp &nbsp   &nbsp   --- нефрит <br>
    &nbsp &nbsp   &nbsp   --- ХПН (хроническая почечная недостаточность) <br>
     &nbsp &nbsp   &nbsp  --- ОПН (острая почечная недостаточность) <br>
    &nbsp &nbsp   &nbsp   --- кисты в почках <br>
     &nbsp &nbsp   &nbsp  --- новообразования почек <br>
    &nbsp  <b>-- Заболевания печени:</b> <br>
    &nbsp &nbsp   &nbsp   --- гепатит <br>
     &nbsp &nbsp   &nbsp  --- гепатоз <br>
    &nbsp &nbsp   &nbsp   --- кисты в печени <br>
     &nbsp &nbsp   &nbsp  --- отравление гепатотропными ядами <br>
     &nbsp &nbsp   &nbsp  --- желчекаменная болезнь <br>
     &nbsp  <b>-- Заболевания органов дыхательной системы</b> <br>
     &nbsp &nbsp   &nbsp  --- бронхо-пневмония <br>
     &nbsp &nbsp   &nbsp  --- ларингит <br>
     &nbsp &nbsp   &nbsp  --- плеврит <br>
      &nbsp &nbsp   &nbsp --- отек легких <br>
      &nbsp &nbsp   &nbsp --- колапс трахеи <br><br>

 <h3>ЛЕЧЕНИЕ ГОРМОНАЛЬНЫХ НАРУШЕНИЙ</h3>
   &nbsp  &nbsp -- сахарный диабет кошек и собак <br><br>
     &nbsp <h4>ЛЕЧЕНИЕ ГРЫЗУНОВ</h4><br>
    &nbsp  <h4>ЛЕЧЕНИЕ ПТИЦ</h4><br>