<?php
ini_set('error_reporting', E_ALL);
ini_set('display_errors', 1);
ini_set('display_startup_errors', 1);
// так отображаются все ошибки
//============================
header('Content-type: text/html; charset=utf-8');

?>

<p><b>Параанальные железы (анальные)</b> - ПАЖ -  производные потовых и сальных желез.</p> 
<p>Из домашних животных параанальные железы есть у собак,  кошек, хорьков, скунсов.<br> Многие слышали про то, что скунсы чем-то "стреляют" с попы во время стресса - это и есть секрет ПАЖ, которым они выстреливают во время стресса (кошки могут выстреливать ПАЖ до 1 метра).<br>
Для животных ПАЖ выполняют роль видовои идентификации (узнавания друг друга), привлечения партнеров, отпугивания противников и мечения територии.</p>

<p>Сами ПАЖ располагаются в прямой кишке возле ануса, а их протоки открываются с двух сторон ануса.
В норме опорожнение ПАЖ происходит при дефекации животного, при активном движении или стрессе.
Нормальный секрет ПАЖ от светло-желтого до темно-желтого цвета жидкой консистенции.</p>

<p><b>Причины патологии параанальных желез:</b><br>
 - аллергии<br>
 - воспалительные процессы в области ануса и прямой кишки<br>
 - нарушение питания - высокобелковая пища (очень много мяса), перекормы<br>
 - малоподвижность<br>
 - перенесенные ранее запоры или поносы<br>
 - отсуствие половой активности<br>
 - попадание инфекции<br>
 При действии любой из этих причин секрет ПАЖ может сильно густеть (вплоть до консистенции пластилина) и содержать "крошки" - сильно сгущенный секрет с эпителием самих проток. В этом случае сгущенный секрет ПАЖ выполняет роль "пробки" - закупоривает протоки, что приводит к накоплению секрета, переполнения ПАЖ и невозможности его выведения во внешнюю среду естественным способом, что рано или поздно приводит к формированию абсцеса параанальной железы (одной или обоих).</p>

<p><b>Признаки закупоривания параанальных желез:</b><br>
 - животное часто лижет область ануса и \ или "ездит на попе"<br>
 - если поднять хвост иногда можно увидеть пробки в протоках ПАЖ в виде больших черных точек или тонких черных трубок с двух сторон ануса (не всегда!)<br>
 - покраснение и \ или отечность в области ануса<br>
 - при формировании абсцеса ПАЖ - с одной (чаще) или двух сторон ануса можно увидеть припухлость размером от горошины до грецкого ореха или даже куриного яйца<br>
 - при вскрытии абсцесса рядом с анусом образуется дополнительное отверстие от 1-2 мм до 2-3 см с выделением гноя белого, желтого или серого цвета с сильным гнойным запахом (если есть примесь крови оттенок может от светло-розового до темно-крассного)</p>
 
 <p><b>Косвенные признаки заболевания параанальных желез:</b><br>
  - сильный зуд животного по всему телу (если исключены блошиный дерматит и аллергия)<br>
  - образование ран на коже долго не заживающих от нескольких милиметров или сантиметров до больших, размером 10-15 см, плохо поддающихся лечению или которые невозможно вылечить неделями и даже месяцами (в норме большинство ран на коже можно вылечить за 5-7-10-14 дней)<br>
  - частые или периодические запоры (переполненые железы частично закрывают проход для кала)<br>
  - болезненость при дефекации (животное скулит \ мяукает при попытке покакать) или пустые попытки дефекации</p>

  <p><b><u>Советы владельцам животных:</u></b><br>
   - один раз  в 5-6 месяцев проводить санацию параанальных желез (приходите к ветеринарному врачу и горорите :<br>  "нам почистить железы (или нам почистить "попу"")) - для животного данная процедура может быть часто неприятна или даже болезнена<br>
   - если при санации ПАЖ секрет окажется не жидким и светло-желтым, а, например, густым, серого или черного цвета или с содержанием "крошек" - такие железы необходимо промыть (хлоргексидином) с помощью внутривенного катетера для освобождения протоков желез от пробок, которые препятствуют нормальному выведению секрета наружу<br>
   - если у животного заметна припухлость с одной или с обоих сторон ануса (или выделяется гной с сильным запахом),  сильная болезненость - необходимо обратьтся к врачу для вскрытия абсцесса ПАЖ с дальнейшей обработкой антисептиками и антибиотикотерапии (по выбору врача)<br>
 - не перекармливать животных, не давать очень много белковых кормов взрослым и старым животным(мясо, творог) </p>
