Типы стилей:
 - стиль браузера (по умолчанию)
 - стиль автора (от разработчика)
 - стиль пользователя (через настройки браузера)
<!--  -------------------------- -->
Приоритеты стилей:
 - стиль пользователя 
 - стиль автора 
 - стиль браузера 
<!--  ----------------------------- -->
Преимущества CSS:
 - Разграничение кода и оформления
 - Разное оформление для разных устройств
 - Расширенные по сравн. с HTML способы оформления элементов
 - Ускорение загрузки сайта (CSS кешируется)
 - Единое стилевое оформление множества документов
 - Централизованное хранение