<?php
ini_set('error_reporting', E_ALL);
ini_set('display_errors', 1);
ini_set('display_startup_errors', 1);
// так отображаются все ошибки
//============================
//  63 - Регулярные выражения ?>

Необходимы в компоненте Router  <?

$string = 'Ученик сидит за партой';
$pattern = '/Ученик/';

$result = preg_match($pattern, $string);

var_dump($result);  //int(1) = true - есть совпадения

// ======================================
$string = 'Он закончил школу в 2000 году. Стал студентом в 2002.';
$pattern = '/2000/';// 2000
var_dump($result);  //int(1) = true - есть совпадения
// ============================================
$string = 'Он закончил школу в 2000 году. Стал студентом в 2002.';
$pattern = '/200[0-5]/';// 2000-2005
var_dump($result);  //int(1) = true - есть совпадения
// =======================================
$string = 'Он закончил школу в 2000 году. Стал студентом в 2002.';
$pattern = '/200[6-9]/';//2006-2009
var_dump($result);  //int(0) = false - нет совпадений
// ======================================
$string = 'Он закончил школу в 2007 году. Стал студентом в 2002.';
$pattern = '/200[2, 5, 8]/';//2202, 2005, 2008
var_dump($result);  //int(1) = true - есть совпадения
// ==================================
$string = 'Он закончил школу в 2007 году. Стал студентом в 2002.';
$pattern = '/200[3, 5, 8]/';//2003, 2005, 2008
var_dump($result);  //int(0) = false - нет совпадений
// =====================================
 $pattern = '/[0-9][0-9][0-9][0-9]/';// 0000-9999
 // =====================================  ?>
 Диапазоны:
  - '/200[0-5]/' = 2000-2005
  - '/[0-5]/' = 0-5
  - '/[3-9]/' = 3-9

 Квантификаторы - "Умножители":
  - '/p{2}/'  = pp ;
  - '/p{3}/'  = ppp ;
  - '/p{4}/'  = pppp ;
  - '/p{2,5}/'  = pp, ppp, pppp, pppppp <!-- без пробела -->
  - '/p{1,}/'  = pp ; p -> ppppppppp... <!-- 1 или более -->
  - '/p{1,}/' = '/p+/'<!-- {1,} = + --> <!-- 1 или более -->
  - '/[0-9]{1,3}/' = 0-999 <!-- 0-9 повторить 1-3 раз --> 