<?php
ini_set('error_reporting', E_ALL);
ini_set('display_errors', 1);
ini_set('display_startup_errors', 1);
// так отображаются все ошибки
//============================
// ООП  - Парадигма = идея и понятия
?>
ПАРАДИГМА - идея и понятия, которые определяют стиль написания программы

ООП - парадигма програмирования, в кот. основными концепциями являются понятия ОБЬЕКТов и КЛАССов

КЛАСС - схема описания и др. документация, по кот. "изготавливается" обьект(q.s.)
Класс = четреж телефона, чертеж автомобиля.

ОБЬЕКТ - предмет, изготовленный по чертежу класса. Имеет свои свойства и возможности.
Обьект = сам телефон (много), сам автомобиль (много).